---
kind: other
id: Methods.T:Autodesk.Revit.DB.ColorFillLegend
source: html/f9e1d0bd-e8d1-7760-f1b1-4d093eb1f8fd.htm
---
# ColorFillLegend Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.